Revit 2024 API
IDuctFittingAndAccessoryPressureDropServer.Calculate Method
 Calculate the duct fitting and duct accessory coefficient.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
bool Calculate(
	DuctFittingAndAccessoryPressureDropData data
)
Visual Basic
Function Calculate ( _
	data As DuctFittingAndAccessoryPressureDropData _
) As Boolean
Visual C++
bool Calculate(
	DuctFittingAndAccessoryPressureDropData^ data
)
Parameters
data
Type: Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryPressureDropData
 The input and output data of the calculation.
Return Value
 True if calculation succeeds. False if calculation fails.
See Also
IDuctFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace